<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Introducci칩n" data-toc-modified-id="Introducci칩n-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Introducci칩n</a></span></li><li><span><a href="#Instalaci칩n" data-toc-modified-id="Instalaci칩n-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Instalaci칩n</a></span></li><li><span><a href="#Introducci칩n-a-las-estructuras-de-datos-de-pandas" data-toc-modified-id="Introducci칩n-a-las-estructuras-de-datos-de-pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Introducci칩n a las estructuras de datos de pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#Buscar-valores-NaN" data-toc-modified-id="Buscar-valores-NaN-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Buscar valores NaN</a></span></li></ul></li><li><span><a href="#Datos-de-lectura/escritura" data-toc-modified-id="Datos-de-lectura/escritura-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Datos de lectura/escritura</a></span><ul class="toc-item"><li><span><a href="#Cargamos-datos-de-formato-CSV" data-toc-modified-id="Cargamos-datos-de-formato-CSV-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Cargamos datos de formato CSV</a></span></li><li><span><a href="#Cargamos-datos-de-formato-xlsx" data-toc-modified-id="Cargamos-datos-de-formato-xlsx-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>Cargamos datos de formato xlsx</a></span></li><li><span><a href="#Visualizamos-las-primeras-filas" data-toc-modified-id="Visualizamos-las-primeras-filas-4.3"><span class="toc-item-num">4.3&nbsp;&nbsp;</span>Visualizamos las primeras filas</a></span></li><li><span><a href="#Visualizamos-las-칰ltimas-filas" data-toc-modified-id="Visualizamos-las-칰ltimas-filas-4.4"><span class="toc-item-num">4.4&nbsp;&nbsp;</span>Visualizamos las 칰ltimas filas</a></span></li><li><span><a href="#Visualizamos-una-muestra-aleatoria" data-toc-modified-id="Visualizamos-una-muestra-aleatoria-4.5"><span class="toc-item-num">4.5&nbsp;&nbsp;</span>Visualizamos una muestra aleatoria</a></span></li></ul></li><li><span><a href="#An치lisis-exploratorio-de-un-dataframe" data-toc-modified-id="An치lisis-exploratorio-de-un-dataframe-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>An치lisis exploratorio de un dataframe</a></span></li><li><span><a href="#Operaciones-b치sicas-con-los-dataframes" data-toc-modified-id="Operaciones-b치sicas-con-los-dataframes-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Operaciones b치sicas con los dataframes</a></span><ul class="toc-item"><li><span><a href="#Seleccionamos-una-columna" data-toc-modified-id="Seleccionamos-una-columna-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>Seleccionamos una columna</a></span></li><li><span><a href="#Seleccionamos-varias-columnas" data-toc-modified-id="Seleccionamos-varias-columnas-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>Seleccionamos varias columnas</a></span></li><li><span><a href="#Obtener-los-valores-칰nicos-de-una-columna-(es-decir,-una-serie)" data-toc-modified-id="Obtener-los-valores-칰nicos-de-una-columna-(es-decir,-una-serie)-6.3"><span class="toc-item-num">6.3&nbsp;&nbsp;</span>Obtener los valores 칰nicos de una columna (es decir, una serie)</a></span></li><li><span><a href="#Cambiar-el-tipo-de-datos-de-una-columna" data-toc-modified-id="Cambiar-el-tipo-de-datos-de-una-columna-6.4"><span class="toc-item-num">6.4&nbsp;&nbsp;</span>Cambiar el tipo de datos de una columna</a></span></li><li><span><a href="#Filtramos-los-datos-por-el-valor-de-las-columnas" data-toc-modified-id="Filtramos-los-datos-por-el-valor-de-las-columnas-6.5"><span class="toc-item-num">6.5&nbsp;&nbsp;</span>Filtramos los datos por el valor de las columnas</a></span></li><li><span><a href="#Copia-de-un-dataframe-y-renombrar-columnas" data-toc-modified-id="Copia-de-un-dataframe-y-renombrar-columnas-6.6"><span class="toc-item-num">6.6&nbsp;&nbsp;</span>Copia de un dataframe y renombrar columnas</a></span><ul class="toc-item"><li><span><a href="#Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-쯢s-suena-esto?" data-toc-modified-id="Podemos-renombrar-las-columnas-machacando-el-atributo-de-la-instancia...-쯢s-suena-esto?-6.6.1"><span class="toc-item-num">6.6.1&nbsp;&nbsp;</span>Podemos renombrar las columnas machacando el atributo de la instancia... 쯢s suena esto?</a></span></li></ul></li><li><span><a href="#Borramos-columnas" data-toc-modified-id="Borramos-columnas-6.7"><span class="toc-item-num">6.7&nbsp;&nbsp;</span>Borramos columnas</a></span></li><li><span><a href="#Borramos-filas" data-toc-modified-id="Borramos-filas-6.8"><span class="toc-item-num">6.8&nbsp;&nbsp;</span>Borramos filas</a></span></li><li><span><a href="#Reset_index-y-set_index" data-toc-modified-id="Reset_index-y-set_index-6.9"><span class="toc-item-num">6.9&nbsp;&nbsp;</span>Reset_index y set_index</a></span><ul class="toc-item"><li><span><a href="#SET_INDEX" data-toc-modified-id="SET_INDEX-6.9.1"><span class="toc-item-num">6.9.1&nbsp;&nbsp;</span>SET_INDEX</a></span></li></ul></li><li><span><a href="#Operaciones-entre-columnas" data-toc-modified-id="Operaciones-entre-columnas-6.10"><span class="toc-item-num">6.10&nbsp;&nbsp;</span>Operaciones entre columnas</a></span></li></ul></li><li><span><a href="#Apply-!!" data-toc-modified-id="Apply-!!-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Apply !!</a></span></li><li><span><a href="#Df-.loc-e-.iloc" data-toc-modified-id="Df-.loc-e-.iloc-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Df .loc e .iloc</a></span><ul class="toc-item"><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-mediante-posici칩n-con-iloc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-mediante-posici칩n-con-iloc-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas mediante posici칩n con iloc</a></span></li><li><span><a href="#Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc" data-toc-modified-id="Seleccionar-filas-y-columnas-en-Pandas-en-base-a-etiquetas-con-loc-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>Seleccionar filas y columnas en Pandas en base a etiquetas con loc</a></span><ul class="toc-item"><li><span><a href="#En-base-a-etiqueta" data-toc-modified-id="En-base-a-etiqueta-8.2.1"><span class="toc-item-num">8.2.1&nbsp;&nbsp;</span>En base a etiqueta</a></span></li><li><span><a href="#En-base-a-una-condici칩n" data-toc-modified-id="En-base-a-una-condici칩n-8.2.2"><span class="toc-item-num">8.2.2&nbsp;&nbsp;</span>En base a una condici칩n</a></span></li></ul></li><li><span><a href="#Buscamos-valores-nulos" data-toc-modified-id="Buscamos-valores-nulos-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>Buscamos valores nulos</a></span><ul class="toc-item"><li><span><a href="#쮼s-nulo?" data-toc-modified-id="쮼s-nulo?-8.3.1"><span class="toc-item-num">8.3.1&nbsp;&nbsp;</span>쮼s nulo?</a></span></li><li><span><a href="#쮼s-NO-nulo?" data-toc-modified-id="쮼s-NO-nulo?-8.3.2"><span class="toc-item-num">8.3.2&nbsp;&nbsp;</span>쮼s NO nulo?</a></span></li><li><span><a href="#Sacar-una-suma-de-los-valores-nulos-de-cada-columna" data-toc-modified-id="Sacar-una-suma-de-los-valores-nulos-de-cada-columna-8.3.3"><span class="toc-item-num">8.3.3&nbsp;&nbsp;</span>Sacar una suma de los valores nulos de cada columna</a></span></li></ul></li><li><span><a href="#Borramos-los-valores-nulos" data-toc-modified-id="Borramos-los-valores-nulos-8.4"><span class="toc-item-num">8.4&nbsp;&nbsp;</span>Borramos los valores nulos</a></span></li><li><span><a href="#C칩mo-rellenar-los-datos-que-faltan" data-toc-modified-id="C칩mo-rellenar-los-datos-que-faltan-8.5"><span class="toc-item-num">8.5&nbsp;&nbsp;</span>C칩mo rellenar los datos que faltan</a></span></li></ul></li><li><span><a href="#Borramos-los-duplicados" data-toc-modified-id="Borramos-los-duplicados-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Borramos los duplicados</a></span></li><li><span><a href="#Agregaci칩n-de-datos" data-toc-modified-id="Agregaci칩n-de-datos-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Agregaci칩n de datos</a></span><ul class="toc-item"><li><span><a href="#Concat" data-toc-modified-id="Concat-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>Concat</a></span></li><li><span><a href="#Merge" data-toc-modified-id="Merge-10.2"><span class="toc-item-num">10.2&nbsp;&nbsp;</span>Merge</a></span></li></ul></li><li><span><a href="#Spoiler-fantasioso-de-ma침ana" data-toc-modified-id="Spoiler-fantasioso-de-ma침ana-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Spoiler fantasioso de ma침ana</a></span></li><li><span><a href="#Summary" data-toc-modified-id="Summary-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Summary</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

#Pandas

![pandas](https://media.giphy.com/media/nVsLCrW5iHf6E/giphy.gif)

Mi gif favorito para la que, a partir de ahora, ser치 tu librer칤a favorita 游땘

##Introducci칩n 
Pandas es, sin duda, la biblioteca m치s utilizada en el ecosistema de Python para el an치lisis y la manipulaci칩n de datos. Es r치pida, potente, flexible, f치cil de usar y de c칩digo abierto. 


Entre sus principales caracter칤sticas est치n
* Un objeto **DataFrame** r치pido y eficiente para la manipulaci칩n de datos con indexaci칩n integrada
* **Lectura y escritura** de datos en multitud de formatos: Microsoflt Excel, CSV, bases de datos SQL, etc;
* M칠todos integrados y eficientes para todo tipo de manipulaci칩n de datos: datos faltantes, subconjunto, uni칩n, fusi칩n, etc; 
* Facilidad para trabajar con datos temporales (de hecho, Pandas se llama as칤 por "PANnel DAta") 
* Buena **integraci칩n con otras librer칤as** de an치lisis de datos o Machine learning: scikit-learn, scipy, seaborn, plotly, etc;
* Es **ampliamente utilizado** tanto en el sector privado como en el acad칠mico     


Pandas proporciona estructuras de datos de alto nivel y funciones dise침adas para hacer que el trabajo con datos estructurados o tabulares sea r치pido, f치cil y expresivo. Desde su aparici칩n en 2010, ha ayudado a que Python sea un entorno de an치lisis de datos potente y productivo. Los principales objetos de pandas que se utilizar치n en este libro son el DataFrame, una estructura de datos tabular orientada a columnas con etiquetas de filas y columnas, y la Serie, un objeto de matriz unidimensional etiquetado.

Pandas combina las ideas de alto rendimiento de NumPy con las capacidades flexibles de manipulaci칩n de datos de las hojas de c치lculo y las bases de datos relacionales (como SQL). Proporciona una sofisticada funcionalidad de indexaci칩n para facilitar la remodelaci칩n, el corte y la divisi칩n, la realizaci칩n de agregaciones y la selecci칩n de subconjuntos de datos.

![image](https://thumbor.forbes.com/thumbor/960x0/https%3A%2F%2Fblogs-images.forbes.com%2Fgilpress%2Ffiles%2F2016%2F03%2FTime-1200x511.jpg)



Fuente: [Forbes](https://www.forbes.com/sites/gilpress/2016/03/23/data-preparation-most-time-consuming-least-enjoyable-data-science-task-survey-says/#1ba071616f63)

##Instalaci칩n

Lo primerito que deber치s hacer, siempre ser치     
pip install pandas

In [1]:
import pandas as pd

## Introducci칩n a las estructuras de datos de pandas
Para empezar con pandas, necesitar치s sentirte c칩modo con sus dos estructuras de datos de trabajo: Series y DataFrame. Aunque no son una soluci칩n universal para todos los problemas, proporcionan una base s칩lida y f치cil de usar para la mayor칤a de las aplicaciones.

### Series
Una Serie es un objeto tipo array unidimensional que contiene una secuencia de valores (de tipos similares a los de NumPy) y un array asociado de etiquetas de datos, llamado su 칤ndice. La Serie m치s sencilla se forma a partir de un 칰nico array de datos:

In [2]:
serie = pd.Series(["hola", 2,3, "otro string"])

In [3]:
serie.values

array(['hola', 2, 3, 'otro string'], dtype=object)

In [4]:
type(serie)

pandas.core.series.Series

In [5]:
serie

0           hola
1              2
2              3
3    otro string
dtype: object

La representaci칩n en cadena de una Serie mostrada interactivamente muestra el 칤ndice a la izquierda y los valores a la derecha. Como no especificamos un 칤ndice para los datos, se crea uno por defecto formado por los enteros 0 a N - 1 (donde N es la longitud de los datos). Puedes obtener la representaci칩n del array y el objeto 칤ndice de la Serie a trav칠s de sus atributos values e index, respectivamente:

In [6]:
serie.values

array(['hola', 2, 3, 'otro string'], dtype=object)

In [7]:
serie.index

RangeIndex(start=0, stop=4, step=1)

Otra forma de pensar en una Serie es como un dict ordenado de longitud fija, ya que es un mapeo de valores de 칤ndice a valores de datos. Se puede utilizar en muchos contextos en los que se podr칤a utilizar un diccionario.
Si tienes datos contenidos en un dict de Python, puedes crear una Serie a partir de ellos pasando el dict:

In [8]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [9]:
serie2 = pd.Series(sdata)
serie2

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [10]:
serie2.index

Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')

Cuando s칩lo se pasa un dict, el 칤ndice de la Serie resultante tendr치 las claves del dict en orden. Puedes anular esto pasando las claves del dict en el orden que desee que aparezcan en la Serie resultante:

In [11]:
estados = ['California', 'Ohio', 'Oregon', 'Texas']

In [12]:
serie3 = pd.Series(sdata, index=estados)
serie3

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Aqu칤, los tres valores encontrados en sdata se colocaron en los lugares apropiados, pero como no se encontr칩 ning칰n valor para 'California', aparece como NaN (no es un n칰mero), lo que se considera en pandas para marcar valores perdidos o NA. Como "Utah" no se incluy칩 en los estados, se excluye del objeto resultante.

In [13]:
import numpy as np

In [14]:
np.nan

nan

### Buscar valores NaN
NaN significa Not A Number (No es un n칰mero) y es una de las formas habituales de representar el valor que falta en los datos. Es un valor especial de punto flotante y no puede ser convertido a otro tipo que no sea float.
El valor NaN es uno de los principales problemas en el an치lisis de datos. Es muy esencial tratar con NaN para obtener los resultados deseados.

In [15]:
# El m칠todo de pandas para buscar NaN es pd.isnull
pd.isnull(serie3)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

## Datos de lectura/escritura

Pandas puede leer y escribir datos de una gran variedad de formatos. [Lee la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)
Aunque una de las m치s comunes es a partir de un dictado de listas de igual longitud o arrays NumPy:

In [16]:
# Desde un diccionario
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, np.nan]}

In [17]:
frame = pd.DataFrame(data)

In [18]:
# Para visualizar un dataframe utilizaremos display y NO print
display(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [19]:
#Desde una lista de diccionarios
datos = [{'nombre': 'Fer',
               'apellido': 'Costa',
               'email': 'fer.costa@ironhack.com',
               'vacaciones': 30,
               'saludo': lambda : print('Holi, soy Fer, hacedme lo primerito la Pull Request')}, 
         
         {'nombre': 'Ana',
               'apellido': 'Garc칤a',
                  'email': 'ana.garcia@ironhack.com',
               'vacaciones': 30,
               'saludo': lambda : print('Hola, soy Ana, cuidado con los print infinitos') }]

In [20]:
len(datos)

2

In [21]:
type(datos[0])

dict

In [22]:
frame2 = pd.DataFrame(datos)

In [23]:
display(frame2)

,nombre,apellido,email,vacaciones,saludo
0,Fer,Costa,fer.costa@ironhack.com,30,<function <lambda> at 0x7fbdbc2f8f70>
1,Ana,Garc칤a,ana.garcia@ironhack.com,30,<function <lambda> at 0x7fbdbc302040>

In [24]:
print(frame2)

  nombre apellido                    email  vacaciones  \
0    Fer    Costa   fer.costa@ironhack.com          30
1    Ana   Garc칤a  ana.garcia@ironhack.com          30

                                  saludo
0  <function <lambda> at 0x7fbdbc2f8f70>
1  <function <lambda> at 0x7fbdbc302040>

Si hago un dataframe a trav칠s de una lista de diccionarios:       
    - Cada diccionario ser치 una fila   
    - Las keys ser치n los nombres de las columnas    
    - Tienen que tener la misma estructura

Como estamos usando Jupyter Notebook, los objetos DataFrame de pandas se mostrar치n como una tabla HTML m치s amigable para el navegador.

###Cargamos datos de formato CSV

In [25]:
df = pd.read_csv("../datasets/avocado_kaggle.csv")

In [26]:
display(df)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [27]:
df.shape

(18249, 14)

### Cargamos datos de formato xlsx

In [28]:
retail = pd.read_excel("../datasets/Online Retail.xlsx")
retail

,InvoiceNo,InvoiceNo.1,InvoiceNo.2,InvoiceNo.3,InvoiceNo.4,InvoiceNo.5,InvoiceNo.6,InvoiceNo.7,InvoiceNo.8
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.60,13408,United Kingdom
...,...,...,...,...,...,...,...,...,...
396029,580691,2011-12-05 15:48:00,90214W,"LETTER ""W"" BLING KEY RING",12,0.29,3.48,13790,United Kingdom
396030,580691,2011-12-05 15:48:00,90214Z,"LETTER ""Z"" BLING KEY RING",12,0.29,3.48,13790,United Kingdom
396031,580865,2011-12-06 11:58:00,90089,PINK CRYSTAL SKULL PHONE CHARM,12,0.19,2.28,17914,United Kingdom
396032,580865,2011-12-06 11:58:00,90089,PINK CRYSTAL SKULL PHONE CHARM,12,0.19,2.28,17914,United Kingdom
396033,581425,2011-12-08 15:31:00,90089,PINK CRYSTAL SKULL PHONE CHARM,1,0.19,0.19,14796,United Kingdom

In [29]:
retail.shape

(396034, 9)

###Visualizamos las primeras filas

In [30]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

Por defecto head me muestra las 5 primeras filas, puedo ver algunas m치s o algunas menos pas치ndole un n칰mero como par치metro

In [33]:
df.head(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [34]:
retail.head(10)

,InvoiceNo,InvoiceNo.1,InvoiceNo.2,InvoiceNo.3,InvoiceNo.4,InvoiceNo.5,InvoiceNo.6,InvoiceNo.7,InvoiceNo.8
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.60,13408,United Kingdom
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom
6,536401,2010-12-01 11:21:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,4,2.95,11.80,15862,United Kingdom
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.40,17850,United Kingdom
8,536502,2010-12-01 12:36:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,16552,United Kingdom
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3,2.95,8.85,14729,United Kingdom

###Visualizamos las 칰ltimas filas

In [33]:
df.tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

Excatamente igual que con .head() le pasamos un par치metro a .tail()

In [34]:
df.tail(3)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

### Visualizamos una muestra aleatoria

In [35]:
 #si no le pasamos un par치metro, visualiza una sola fila de forma aleatoria.

In [36]:
df.sample()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12249,4,2016-11-27,2.04,111851.52,21468.08,49401.43,9.22,40972.79,34501.89,6470.9,0.0,organic,2016,California

In [37]:
#Muestra aleatoria de 5 filas
df.sample(5)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
15046,40,2017-03-26,2.16,4486.25,0.00,451.29,0.00,4034.96,738.89,3296.07,0.0,organic,2017,BuffaloRochester
7604,27,2017-06-25,1.24,297426.95,92985.13,87499.38,6296.21,110646.23,105884.61,1991.62,2770.0,conventional,2017,RaleighGreensboro
16753,51,2017-01-08,1.52,11276.02,179.81,4508.40,369.14,6218.67,6018.60,200.07,0.0,organic,2017,RaleighGreensboro
15777,29,2017-06-11,0.84,15511.39,100.36,1100.69,0.00,14310.34,652.77,13657.57,0.0,organic,2017,Indianapolis
12534,29,2016-06-05,1.05,26357.74,9412.30,640.22,0.00,16305.22,13879.09,2426.13,0.0,organic,2016,DallasFtWorth

In [38]:
#Muestra aleatoria del 10%
df.sample(frac=0.1).head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
7153,0,2017-12-31,1.31,3652549.70,235982.42,2537022.88,7412.85,872131.55,658153.52,213974.56,3.47,conventional,2017,Northeast
13781,28,2016-06-12,1.63,51075.07,5529.79,22175.76,2574.67,20794.85,16998.34,3796.51,0.00,organic,2016,Plains
5006,14,2016-09-18,1.50,813575.88,173635.07,549722.44,9254.46,80963.91,75829.93,3098.42,2035.56,conventional,2016,SanFrancisco
14190,21,2016-07-31,1.34,48248.63,3816.63,12705.33,38.64,31688.03,2455.73,29232.30,0.00,organic,2016,Seattle
8780,2,2018-03-11,1.15,3874143.18,1003594.96,1291212.19,26832.41,1552503.62,1389780.99,153631.49,9091.14,conventional,2018,Midsouth

##ㅁn치lisis exploratorio de un dataframe

In [39]:
df.shape

(18249, 14)

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18249 entries, 0 to 18248
Data columns (total 14 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    18249 non-null  int64
 1   Date          18249 non-null  object
 2   AveragePrice  18249 non-null  float64
 3   Total Volume  18249 non-null  float64
 4   4046          18249 non-null  float64
 5   4225          18249 non-null  float64
 6   4770          18249 non-null  float64
 7   Total Bags    18249 non-null  float64
 8   Small Bags    18249 non-null  float64
 9   Large Bags    18249 non-null  float64
 10  XLarge Bags   18249 non-null  float64
 11  type          18249 non-null  object
 12  year          18249 non-null  int64
 13  region        18249 non-null  object
dtypes: float64(9), int64(2), object(3)
memory usage: 1.9+ MB

In [41]:
df.describe()

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
count,18249.000000,18249.000000,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,1.824900e+04,18249.000000,18249.000000
mean,24.232232,1.405978,8.506440e+05,2.930084e+05,2.951546e+05,2.283974e+04,2.396392e+05,1.821947e+05,5.433809e+04,3106.426507,2016.147899
std,15.481045,0.402677,3.453545e+06,1.264989e+06,1.204120e+06,1.074641e+05,9.862424e+05,7.461785e+05,2.439660e+05,17692.894652,0.939938
min,0.000000,0.440000,8.456000e+01,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,0.000000,2015.000000
25%,10.000000,1.100000,1.083858e+04,8.540700e+02,3.008780e+03,0.000000e+00,5.088640e+03,2.849420e+03,1.274700e+02,0.000000,2015.000000
50%,24.000000,1.370000,1.073768e+05,8.645300e+03,2.906102e+04,1.849900e+02,3.974383e+04,2.636282e+04,2.647710e+03,0.000000,2016.000000
75%,38.000000,1.660000,4.329623e+05,1.110202e+05,1.502069e+05,6.243420e+03,1.107834e+05,8.333767e+04,2.202925e+04,132.500000,2017.000000
max,52.000000,3.250000,6.250565e+07,2.274362e+07,2.047057e+07,2.546439e+06,1.937313e+07,1.338459e+07,5.719097e+06,551693.650000,2018.000000

In [42]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,18249.0,24.232232,1.548104e+01,0.00,10.00,24.00,38.00,52.00
AveragePrice,18249.0,1.405978,4.026766e-01,0.44,1.10,1.37,1.66,3.25
Total Volume,18249.0,850644.013009,3.453545e+06,84.56,10838.58,107376.76,432962.29,62505646.52
4046,18249.0,293008.424531,1.264989e+06,0.00,854.07,8645.30,111020.20,22743616.17
4225,18249.0,295154.568356,1.204120e+06,0.00,3008.78,29061.02,150206.86,20470572.61
4770,18249.0,22839.735993,1.074641e+05,0.00,0.00,184.99,6243.42,2546439.11
Total Bags,18249.0,239639.202060,9.862424e+05,0.00,5088.64,39743.83,110783.37,19373134.37
Small Bags,18249.0,182194.686696,7.461785e+05,0.00,2849.42,26362.82,83337.67,13384586.80
Large Bags,18249.0,54338.088145,2.439660e+05,0.00,127.47,2647.71,22029.25,5719096.61
XLarge Bags,18249.0,3106.426507,1.769289e+04,0.00,0.00,0.00,132.50,551693.65
year,18249.0,2016.147899,9.399385e-01,2015.00,2015.00,2016.00,2017.00,2018.00

In [43]:
df.AveragePrice.min()

0.44

In [44]:
df.AveragePrice.max()

3.25

In [45]:
df.AveragePrice.mean()

1.405978409775878

In [46]:
df.AveragePrice.sum()

25657.699999999997

In [47]:
df.AveragePrice.value_counts()

1.15    202
1.18    199
1.08    194
1.26    193
1.13    192
       ...
2.91      1
2.68      1
3.04      1
3.17      1
3.03      1
Name: AveragePrice, Length: 259, dtype: int64

In [48]:
#df.region.value_counts()

In [49]:
df["Total Bags"].max()

19373134.37

In [50]:
# Seleccionamos las columnas numericas
numericas = df._get_numeric_data().head()
numericas.head()

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,2015
1,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,2015
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,2015
3,3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,2015
4,4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,2015

In [51]:
# Seleccionamos las columnas cuyo tipo de dato es int64
df.select_dtypes(include="int64").head()

   Unnamed: 0  year
0           0  2015
1           1  2015
2           2  2015
3           3  2015
4           4  2015

In [52]:
# Podemos incluir y excluir
df.select_dtypes(include = ["int64", "float64"], exclude="datetime64[ns]").head()

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,year
0,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,2015
1,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,2015
2,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,2015
3,3,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,2015
4,4,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,2015

##Operaciones b치sicas con los dataframes

###Seleccionamos una columna

In [53]:
# Tengo una serie de pandas
unacolumna = df.year
unacolumna

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
18244    2018
18245    2018
18246    2018
18247    2018
18248    2018
Name: year, Length: 18249, dtype: int64

In [54]:
type(df.year)

pandas.core.series.Series

In [55]:
# Si solo pongo unos corchetes, tengo una serie de pandas

In [56]:
# Tengo una serie de pandas
df["year"]

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
18244    2018
18245    2018
18246    2018
18247    2018
18248    2018
Name: year, Length: 18249, dtype: int64

In [57]:
# Si a pesar de pasarle una lista, solo tiene un elemento, tengo un dataframe con una sola columna
df[["year"]].head()

   year
0  2015
1  2015
2  2015
3  2015
4  2015

In [58]:
#O dos :), o las que queramos

In [59]:
df[["year", "Large Bags"]].head()

   year  Large Bags
0  2015       93.25
1  2015       97.49
2  2015      103.14
3  2015      133.76
4  2015      197.69

###Seleccionamos varias columnas

In [60]:
lista_columnas = ['Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags']

In [61]:
#le podemos pasar directamente una lista con los nombres de las columnas
df[lista_columnas].head()

   Total Bags  Small Bags  Large Bags  XLarge Bags
0     8696.87     8603.62       93.25          0.0
1     9505.56     9408.07       97.49          0.0
2     8145.35     8042.21      103.14          0.0
3     5811.16     5677.40      133.76          0.0
4     6183.95     5986.26      197.69          0.0

In [62]:
# Listar los nombres de columnas de un dataframe
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [63]:
columnas = list(df.columns)

In [64]:
print(columnas)

['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225', '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type', 'year', 'region']

### Obtener los valores 칰nicos de una columna (es decir, una serie)

In [65]:
df.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [66]:
df["type"].unique()

array(['conventional', 'organic'], dtype=object)

In [67]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

### Cambiar el tipo de datos de una columna

In [68]:
# Atenci칩n!! que no se cambian los datos si no sobreescribimos la columna
df.AveragePrice.astype(dtype="int8")

0        1
1        1
2        0
3        1
4        1
        ..
18244    1
18245    1
18246    1
18247    1
18248    1
Name: AveragePrice, Length: 18249, dtype: int8

In [70]:
#df["AveragePrice"] = df.AveragePrice.astype(dtype="int8")

In [71]:
df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

###Filtramos los datos por el valor de las columnas

In [72]:
df.region.unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [73]:
df2 = df[df["region"] == "Houston"]
# ESTO HACE LO MISMO
"""
df2 = df[df.region == "Houston"]
"""

'\ndf2 = df[df.region == "Houston"]\n'

In [74]:
df2.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
936,0,2015-12-27,0.78,944506.54,389773.22,288003.62,126150.81,140578.89,73711.94,36493.62,30373.33,conventional,2015,Houston
937,1,2015-12-20,0.75,922355.67,382444.22,278067.11,127372.19,134472.15,72198.16,31520.66,30753.33,conventional,2015,Houston
938,2,2015-12-13,0.73,998752.95,412187.80,386865.21,81450.04,118249.90,69011.01,48622.22,616.67,conventional,2015,Houston
939,3,2015-12-06,0.74,989676.85,368528.91,490805.00,7041.19,123301.75,61020.31,62281.44,0.00,conventional,2015,Houston
940,4,2015-11-29,0.79,783225.98,391616.95,289533.68,4334.89,97740.46,67880.28,29860.18,0.00,conventional,2015,Houston

In [75]:
df3 = df[df["region"] != "Houston"]
df3.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [76]:
#df.Date.unique()

In [77]:
# multicondici칩n, & and l칩gico
df[(df.region == "Houston") & (df.AveragePrice == 0.78) & (df["Date"] >= '2016-11-13' ) ].head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
6570,0,2017-12-31,0.78,1391181.63,564063.25,209000.62,4194.25,613923.51,527743.84,86179.67,0.0,conventional,2017,Houston
6595,25,2017-07-09,0.78,1513596.50,565234.20,223073.67,3020.20,722268.43,334967.14,387301.29,0.0,conventional,2017,Houston
8703,9,2018-01-21,0.78,1584416.56,651432.75,153445.45,10598.32,768940.04,683790.27,85149.77,0.0,conventional,2018,Houston

In [78]:
# | or logico
df[((df.region == "Albany") | (df.region == "Houston")) & (df["Date"] >= '2016-11-13' ) ].head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
2808,0,2016-12-25,1.52,73341.73,3202.39,58280.33,426.92,11432.09,11017.32,411.83,2.94,conventional,2016,Albany
2809,1,2016-12-18,1.53,68938.53,3345.36,55949.79,138.72,9504.66,8876.65,587.73,40.28,conventional,2016,Albany
2810,2,2016-12-11,1.49,71777.85,2323.39,56545.79,86.65,12822.02,12176.75,645.27,0.00,conventional,2016,Albany
2811,3,2016-12-04,1.48,113031.96,6530.78,99746.05,50.84,6704.29,6476.12,228.17,0.00,conventional,2016,Albany
2812,4,2016-11-27,1.52,58171.89,2793.99,47106.18,18.14,8253.58,7973.98,279.60,0.00,conventional,2016,Albany

In [79]:
df[(df.AveragePrice>=0.71) | (df.year==2015)].tail()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18244,7,2018-02-04,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,2018-01-28,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,2018-01-21,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

------>> Nos hemos quedado aqu칤 <<------ 游댠游

###Copia de un dataframe y renombrar columnas

In [ ]:
# Utilizamos el inplace=True para que se ejecute la acci칩n sobre el dataframe

In [ ]:
# Podr칤amos guardarlo en una nueva variable

In [ ]:
#O podr칤amos machacar la variable df

####Podemos renombrar las columnas machacando el atributo de la instancia... 쯢s suena esto?

### Borramos columnas

In [ ]:
# Axis 1 siempre columnas

### Borramos filas

In [ ]:
# Axis 0 siempre filas

Las filas tambi칠n se pueden eliminar. Ten en cuenta que los 칤ndices no se reinician. El 칤ndice se asocia a la fila, no al orden.   
쯉e puede reiniciar el index? Correcto

###Reset_index y set_index

Leemos la [documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) para entender algunos par치metros

In [ ]:
#Drop = True evita que se genere otra columna con el index anterior

#### SET_INDEX

쯇ara qu칠 nos puede servir tener la fecha como 칤ndice?    
Lo veremos m치s adelante, para analizar series temporales, pero os avanzo un poco de fantas칤a

In [ ]:
import seaborn as sns
sns.set_context('poster')
sns.set(rc={'figure.figsize': (20.,6.)})
sns.set_style('whitegrid')

###Operaciones entre columnas

In [ ]:
# Para generar una columna nueva solo tengo que ponerle un nombre

##ㅁpply !!

Aplica una funci칩n a lo largo de un eje del DataFrame.      
[Lee la doc](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)

In [ ]:
#Creamos una funci칩n sencilla que vamos a aplicar

In [ ]:
# Aplicamos la funci칩n a una columna y vemos el resultado en la salida

In [ ]:
# Vamos a crear una columna nueva haciendo un apply a otra columna

In [ ]:
#Hazlo con lambda!!

##Df .loc e .iloc

### Seleccionar filas y columnas en Pandas mediante posici칩n con iloc

El m칠todo iloc se utiliza en los DataFrames para seleccionar los elementos en base a su ubicaci칩n. Su sintaxis es data.iloc[<filas>, <columnas>], donde <filas> y <columnas> son la posici칩n de las filas y columnas que se desean seleccionar en el orden que aparecen en el objeto. Una notaci칩n familiar para los usuarios de Matlab. En un DataFrame cada una de las filas tiene un n칰mero que va desde 0 hasta el total de filas menos uno. Siendo iloc el m칠todo que permite seleccionar los datos en base a estos n칰meros. Lo mismo que aplica a las columnas.

En iloc hay dos argumentos filas y columnas. En caso de que se omita el segundo, se seleccionar치n todas las columnas de la fila. As칤 para seleccionar diferentes filas se puede utilizar.

In [ ]:
#seleccionamos un registro completo

In [ ]:
#un rango de registros con sliding

In [ ]:
# Registros de la primera columna

In [ ]:
# El segundo argumento, en este caso el n칰mero 1, es la columna, aqu칤 no pasamos string si no posici칩n.

### Seleccionar filas y columnas en Pandas en base a etiquetas con loc
El m칠todo loc se puede usar de dos formas diferentes: seleccionar filas o columnas en base a una etiqueta o seleccionar filas o columnas en base a una condici칩n.

#### En base a etiqueta

####En base a una condici칩n
Quiz치s esta sea una de las opciones m치s interesantes de las vistas, ya que permite seleccionar los datos en un DataFrame en base condiciones l칩gicas. Las cuales se pueden obtener a partir de los valores

쯈ueremos meterle m치s de una doncidici칩n? let`s go!

Sintaxis del loc con varias condiciones
```python 
df.loc[(df["columna"] condici칩n) & (df["columna"] condici칩n)]
````

Misma operaci칩n, pero dame solo columnas concretas

### Buscamos valores nulos

In [ ]:
import seaborn as sns

#### 쮼s nulo?

#### 쮼s NO nulo?

#### Sacar una suma de los valores nulos de cada columna

###Borramos los valores nulos
Hay varias formas de hacerlo, tenemos en cuenta el par치metro "how" y, desde luego, [nos leemos la documentaci칩n](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html).

In [ ]:
#Con "all" borramos donde TODOS los registros sean NaN

Con "any" (par치metro que viene by default as칤 que ojo con no poner nada) se borran todos los registros en los que en alguna columna haya un NaN

In [ ]:
# Si pongo axis 1 trabajo con columnas, por tanto, me cargar칠 aquellas columnas que tengan un solo NaN

### C칩mo rellenar los datos que faltan

쯈u칠 os parece un poquito de [documentaci칩n](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html)?

##Borramos los duplicados

##ㅁgregaci칩n de datos
Un DataFrame puede agruparse en sus filas (eje=0) o en sus columnas (eje=1). Una vez hecho esto, se aplica una funci칩n a cada grupo, produciendo un nuevo valor. Finalmente, los resultados de todas esas aplicaciones de funciones se combinan en un objeto resultado. La forma del objeto resultante depender치 normalmente de lo que se haga con los datos.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html

In [ ]:
import numpy as np

In [ ]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],'data1' : np.random.randn(5),'data2' : np.random.randn(5)})

Supongamos que queremos calcular la media de la columna data1 utilizando las etiquetas de key1. Hay varias formas de hacerlo. Una es acceder a datos1 y llamar a groupby con la columna (una Serie) en key1:

Los datos (una Serie) han sido agregados seg칰n la clave de grupo, produciendo una nueva Serie que ahora est치 indexada por los valores 칰nicos de la columna clave1. El 칤ndice resultante tiene el nombre 'clave1' porque la columna DataFrame df['clave1'] lo hizo.    
Si en su lugar hubi칠ramos pasado m칰ltiples arrays como una lista, obtendr칤amos algo diferente:

Otra forma de groupby con sintaxis agg     
https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html

### Concat

### Merge

##Spoiler fantasioso de ma침ana

https://plotly.com/python/bar-charts/

In [ ]:
import plotly.express as px

In [ ]:
long_df = px.data.medals_long()

In [ ]:
fig = px.bar(long_df, x="nation", y="count", color="medal", title="Long-Form Input")
fig.show()

## Summary

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)
* [Materials by a friend of a friend Juan Huguet](https://github.com/juanhuguetgarcia/uib-aa-g1-material/tree/master/W1%20-%20Intro%20to%20python%20y%20pandas)